app/models/park.rb

    def num_reviews
        return self.reviews.length
---
SELECT "reviews".* FROM "reviews" INNER JOIN "trails" ON "reviews"."trail_id" = "trails"."id" WHERE "trails"."park_id" = $1  [["park_id", 5]]