app/models/trail.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."trail_id" = $1  [["trail_id", 2]]
---
    def calc_avg_rating
        reviews = self.reviews
        rating_total =
        if reviews.length > 0