app/models/user.rb

    def self.find_by_credentials(credential, password)
        user = User.find_by(email: credential)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "demo@user.io"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = generate_unique_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-02-27 00:03:19.663428"], ["id", 12]]

    def generate_unique_session_token
        session_token = SecureRandom.urlsafe_base64
        return session_token unless User.exists?(session_token: session_token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]