app/views/api/parks/_park.json.jbuilder


if park.trails.any?
---
SELECT "trails".* FROM "trails"