app/views/api/parks/index.json.jbuilder

SELECT "trails".* FROM "trails"
---
# N+1 problem
parks = @parks.includes(:trails)