app/views/api/parks/show.json.jbuilder

SELECT "trails".* FROM "trails" WHERE "trails"."park_id" = $1  [["park_id", 5]]
---
json.trails do
    @park.trails.each do |trail|

SELECT "reviews".* FROM "reviews" WHERE "reviews"."trail_id" = $1  [["trail_id", 9]]
---
        json.extract! trail, :id, :trail_name, :latitude, :longitude, :length, :difficulty_level, :elevation_gain, :route_type, :estimated_time, :description, :tags, :park_id
        json.imagePreviewUrl trail.images.attached? ? url_for(trail.images.first) : nil