app/views/api/trails/index.json.jbuilder

SELECT "reviews".* FROM "reviews" WHERE "reviews"."trail_id" = $1  [["trail_id", 9]]
SELECT "parks".* FROM "parks"
---
# N+1 problem
trails = @trails.includes(:park).includes(:reviews)