app/views/api/trails/show.json.jbuilder

SELECT "reviews".* FROM "reviews" WHERE "reviews"."trail_id" = $1  [["trail_id", 6]]
---
json.parkName trail.park.park_name
json.reviews trail.reviews.map do |review|